#ifndef _USER_GPIO_H_
#define _USER_GPIO_H_
#include "stdbool.h"
#include "common/gpio_ctrl.h"
/***********************************************
** 作者: leo.liu
** 日期: 2022-11-9 10:15:48
** 说明: 读取ir的高低电平
***********************************************/
GPIO_LEVEL ir_feed_read(void);
/***********************************************
** 作者: leo.liu
** 日期: 2022-11-9 10:15:48
** 说明: 设置led的电平
***********************************************/
void led_ctrl_enable(bool en);
/***********************************************
** 作者: leo.liu
** 日期: 2022-11-9 10:15:48
** 说明: gpio初始化
***********************************************/
bool user_gpio_init(void);
/***********************************************
** 作者: leo.liu
** 日期: 2022-11-9 10:15:48
** 说明: 控制灯闪烁
***********************************************/
void led_ctrl_blink(int num);
/***********************************************
** 作者: leo.liu
** 日期: 2022-11-9 10:15:48
** 说明: 读取gpio 电平
***********************************************/
GPIO_LEVEL led_ctrl_level_read(void);
#endif